Reports/ИсторияЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ИсторияЦен</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатурыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатурыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦены</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеМатериалов</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзделиеПредварительный</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособЗаполненияЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗаполненияЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ИсторияЦен/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТаблицаЦенПередНачаломИзменения(Элемент, Отказ)
	Если Элемент.ТекущийЭлемент.Имя = "ТаблицаЦенДокумент" Тогда
		Отказ = Истина;
		ТД = Элементы.ТаблицаЦен.ТекущиеДанные;
		Если ЗначениеЗаполнено(ТД.Документ) Тогда
			ПоказатьЗначение(,ТД.Документ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦенПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦенПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Этаформа.Параметры.Номенклатура) Тогда
		Отказ = Истина;
		Возврат
	КонецЕсли;
	ЭтаФорма.Номенклатура = Этаформа.Параметры.Номенклатура;
	
	СформироватьТаблицу();
КонецПроцедуры

&НаСервере
Процедура СформироватьТаблицу()
	ЭтаФорма.ТаблицаЦен.Загрузить(РегистрыСведений.ЦеныНоменклатурыДокументов.ПолучитьИсториюЦен(ЭтаФорма.Номенклатура));
КонецПроцедуры // СформироватьТаблицу()

&НаКлиенте
Процедура Обновить(Команда)
	СформироватьТаблицу();
КонецПроцедуры
